stats_title_text = '<b>Статистика</b>'

stats_text = """
<b>📊 Статистика за {}</b>

<b>👤 Пользователи:</b>
<b>Всего:</b> {}

<b>🌎 ГЕО:</b>
{}

<b>🛒 Количество купленных курсов:</b> {}
<b>📥 Общая сумма пополнения баланса:</b> {}
<b>📤 Общая сумма вывода с баланса:</b> {}
"""

leader_menu_text = 'Добро пожаловать в меню Руководителя! 👤'

leader_menu_rightsError_text = 'У вас нет нужных прав для использования данной команды! ❌'

send_supportTicketID_text = 'Напишите номер нужного вам тикета поддержки ✍️'

send_supportTicketID_error_text = '''
Тикета с поддержки с таким номером не существует или он ещё открыт! ❌

Попробуйте ещё раз ✍️
'''

send_messages_of_supportTicket_text = '👇 Сообщения тикета поддержки <i>№{}</i>:'

sending_supportTicket_supportAgent_message_text = """
Сообщение от Агента Поддержки <i>@{}</i>:

<i>{}</i>
"""

sending_supportTicket_user_message_text = """
Сообщение от Пользователя <i>@{}</i>:

<i>{}</i>
"""

sending_supportTicket_user_start_message_text = """
Изначальный запрос Пользователя <i>@{}</i> в тикете поддержки:

<i>{}</i>
"""

send_username_for_changeBalance_text = 'Напишите username пользователя, которому вы хотите изменить баланс ✍️'

send_currentUserBalance_text = '''
Текущий баланс пользователя @{}: {} RUB.

Напишите новый баланс для пользователя числом ✍️
'''

change_userBalance_success_text = 'Баланс пользователя @{} успешно изменён с <i>{} -> {} RUB</i>! ✅'

send_user_changeBalance_text = 'Ваш баланс изменён Руководителем с <i>{} -> {} RUB</i>!'

send_username_for_changeStatus_text = 'Напишите username пользователя, которому вы хотите изменить статус ✍️'

send_currentUserStatus_text = '''
Текущий статус пользователя @{}: {}.

Выберите новый статус из нижеперечисленных 👇
'''

change_userStatus_success_text = 'Статус пользователя @{} успешно изменён с <i>{} -> {}</i>! ✅'

send_user_changeStatus_text = 'Ваш статус изменён Руководителем с <i>{} -> {}</i>!'
