# Меню профиля
profile_text = '''👤 Профиль. 

Статус: {}
Дата регистрации: {}

Пройдено курсов ({}): 
{}

💸 Баланс: {} RUB'''

partner_profile_text = '''👤 Профиль <b><i>🌟 ПАРТНЁРА 🌟</i></b>

📆 Дата регистрации: {}

🛒 Пройдено курсов ({}): 
{}

💸 Баланс: {} RUB'''

# Кнопка "📥 Пополнить"
profile_choose_payment_text = 'Выберите способ оплаты:'

profile_choose_sumOfPayment_text = 'Введите сумму для пополнения в рублях:'

successful_replenish_text = 'Пополнение баланса на сумму {} RUB прошло успешно! ✅'

# Кнопка "📤 Вывести"
profile_choose_withdraw_text = '''
Вывод средств происходит автоматически в течение 24 часов с момента подачи заявки.

Пожалуйста, выберите способ:'''

profile_choose_sumOfWithdraw_text = 'Введите сумму на вывод без пробелов одним сообщением.'

profile_withdraw_write_cardNumber_text = '''
Осуществляем вывод на карты: МИР, Visa, Mastercard

Введите номер карты:'''

profile_payment_write_cardNumber_text = '''
Пополнение осуществляется с карт: МИР, Visa, Mastercard

Введите номер карты:'''

profile_confirmation_card_text = '''
Проверьте данные.

После подтверждения информацию будет невозможно изменить. 

Способ: Банковская карта
└ Реквизиты: {}

Сумма: {} RUB'''

profile_confirmation_crypto_text = '''
Проверьте данные.

После подтверждения информацию будет невозможно изменить. 

Способ: Криптовалюта

Сумма: 
В RUB: {}
В USDT: {}'''

profile_withDraw_check_text = """
С вашего баланса списано {} RUB!

Ваш чек на вывод доступен по кнопке ниже:
"""

profile_withDraw_check_activated_text = "Средства успешно получены ✅"

# Кнопка "🫂 Рефералы"
profile_referals_menu_text = '''
Каждый реферал, купивший курс по Вашей ссылке получает приветственный подарок в виде скидки на следующий курс.

Вы получите 20% стоимости курса на свой баланс, (за исключением покупки по акциям), которыми можете распоряжаться по своему усмотрению. Деньги можно вывести или приобрести любой продукт на площадке.

Ссылка для приглашения: 
<code>{}</code>'''

profile_referals_dynamics_text = '''
📊 Динамика

Конверсия продаж: {}%

Всего рефералов: {}
Курсов куплено: {}

╭ День: {} RUB 
┣ Месяц: {} RUB 
╰ Все время: {} RUB

💸 Баланс: {} RUB

Ваш процент: {}%'''

profile_referals_dynamics_empty_text = '''
📊 Динамика

Всего рефералов: {}

💸 Баланс: {} RUB

Ваш процент: {}%'''

profile_referals_materials_text = '''
Архив рекламных материалов, которые Вы можете использовать для продвижения своей реферальной ссылки.

Бла-Бла-Бла фотки видео и там чет еще'''

successful_referal_replenish_text = '''
Ваш реферал @{} пополнил баланс на сумму {} RUB! ✅

На ваш баланс добавилось {} RUB!
'''

send_manager_referals_text = "👥 Все ваши рефералы на данный момент ({}/{}):"

manager_referals_none_text = "У вас сейчас нет рефералов. 🙁"

send_manager_referal_info_text = "👇 Статистика по рефералу @{}:"

write_ref_percent_for_manager_referal_text = "Напишите нужный реферальный процент для реферала от <i>0 - 50%</i>"

change_ref_percent_for_manager_referal_error_text = """
Процент должен быть от <i>0 до 50%</i>!

Попробуйте ещё раз.
"""

change_ref_percent_manager_referal_text = "Ваш реферальный процент был изменён вашим менеджером @{} с <i>{} -> {}</i>!"

change_ref_percent_manager_text = "Реферальный процент пользователя @{} был изменён с <i>{} -> {}</i>!"
