
support_text = '''
✍️ Задайте свой вопрос, а оператор постарается как можно скорее ответить на него.

Техническая поддержка на связи с 10:00 до 22:00 по МСК.'''

support_addSupportTicket_success_text = 'Тикет поддержки успешно добавлен! ✅'

support_addSupportTicket_error_text = '''
Произошла непредвиденная ошибка на стороне сервера ‼️ 

Попробуйте позже.
'''

send_supportTickets_text = "📨 Все активные тикеты поддержки на данный момент ({}/{}):"

supportTickets_none_text = "Активных тикетов поддержки сейчас нет. 🙁"

send_supportTicket_text = '''
Текст тикета поддержки <i>№{}</i> пользователя @{}:

<i>{}</i>
'''

supportAgent_answer_supportTicket_text = '''
Текст ответа Агента Поддержки <i>@{}</i> по вашему тикету поддержки <i>№{}</i>:

<i>{}</i>
'''

user_answer_supportTicket_text = '''
Текст ответа Пользователя <i>@{}</i> по тикету поддержки <i>№{}</i>:

<i>{}</i>
'''

close_supportTicket_supportAgent_text = '''
Пользователь <i>@{}</i> закрыл тикет поддержки <i>№{}</i>! ✅

Хорошая работа!
'''

close_supportTicket_user_text = 'Тикет поддержки <i>№{}</i> успешно закрыт! ✅'

answer_to_user_for_supportTicket_text = "✍️ Напишите свой ответ пользователю"

answer_to_supportAgent_for_supportTicket_text = "✍️ Напишите свой ответ Агенту поддержки"

send_answer_to_user_for_supportTicket_success_text = "Ответ успешно доставлен пользователю! ✅"

send_answer_to_supportAgent_for_supportTicket_success_text = "Ответ успешно доставлен Агенту поддержки! ✅"

send_answer_for_supportTicket_error_text = "Произошла непредвиденная ошибка! Попробуйте ещё раз."

send_answer_for_supportTicket_alreadyAnswered_text = "На данный тикет уже ответил другой Агент Поддержки!"

evaluate_supportAgent_text = 'Оцените Агента поддержки <i>@{}</i> по 5-бальной шкале:'

evaluate_supportAgent_success_text = 'Агент поддержки <i>@{}</i> успешно оценён на {}/5! ✅'