
support_text = '''
✍️ Задайте свой вопрос, а оператор постарается как можно скорее ответить на него.

Техническая поддержка на связи с 10:00 до 22:00 по МСК.'''

support_addSupportTicket_success_text = 'Тикет поддержки успешно добавлен! ✅'

support_addSupportTicket_error_text = '''
Произошла непредвиденная ошибка на стороне сервера ‼️ 

Попробуйте позже.
'''

send_support_tickets_text = "📨 Все активные тикеты поддержки на данный момент ({}/{}):"

support_tickets_none_text = "Активных тикетов поддержки сейчас нет. 🙁"