faq_menu_text = '''
1. О нас.
2. Сколько длится обучение?
3. Гарантируете возврат средств?
4. Как работает реферальная система
5. Положение о анонимности.
'''

faq_questions_texts = {
    "1": '''
Мы - единственная достойная академия с высоким уровнем сервиса и актуальными знаниями.

В команде академии трудится более 50 профессионалов своего дела. Наши продукты безупречны и развивают действительно полезные навыки социальной сферы жизни.

За столь короткий промежуток мы уже успели обучить более сотни человек разных возрастов. 

Спасибо, что выбираете нас!''',

    "2": '''
Сроки обучения варьируются в зависимости от выбранного Вами курса.

В описании каждого курса есть информация о длительности обучения.

В среднем, 2 недели.''',

    "3": '''
Отвечая на вопрос - да.

Мы гарантируем полный возврат средств в течение 3-х дней с момента покупки курса по любым причинам.

Возврат осуществляется через техническую поддержку в течение 24 часов с момента подачи заявки.''',

    "4": '''
Новый пользователь, перешедший по Вашей ссылке становится Вашим рефералом.

За каждый купленный курс вы будете получать 20% от его стоимости если реферал не запросил возврат средств в течение 3-х дней с момента покупки и реферал не учувствовал в акциях.

Вывод с Вашего баланса осуществляется на CrytoBot или банковскую карту.

К тому же, вы можете потратить средства с баланса на покупку курса''',

    "5": '''
Один из ключевых принципов академии - анонимность.

Мы не собираем и не храним данные о Вас.''',
}