profile_text = '''👤 Профиль. 

Статус: {}
Дата регистрации: {}

Пройдено курсов ({}): 
{}

💸 Баланс: {} RUB'''

# Пополнить
profile_choose_payment_text = 'Выберите способ оплаты:'

profile_choose_sumOfPayment_text = 'Введите сумму для пополнения в рублях:'

# Вывести
profile_choose_withdraw_text = '''
Вывод средств происходит автоматически в течение 24 часов с момента подачи заявки.

Пожалуйста, выберите способ:'''

profile_choose_sumOfWithdraw_text = 'Введите сумму на вывод без пробелов одним сообщением.'

profile_write_cardNumber_text = '''
Осуществляем вывод на карты: МИР, Visa, Mastercard

Введите номер карты:'''

profile_confirmation_text = '''
Проверьте данные.

После подтверждения информацию будет невозможно изменить. 

Способ: {}
└ Реквизиты: {}

Сумма: {}'''

profile_withDraw_agree = 'чет бабки придут в течение суток'
